// Define the Bagalamukhi Temple object in Hindi
const baglamukhiHindi = {
    description: "बगलामुखी मंदिर, बनखंडी भारत के हिमाचल प्रदेश के कांगड़ा जिले में स्थित है। यह देवी बगलामुखी को समर्पित है, जो हिंदू धर्म की देवी और दस महाविद्याओं में से एक है। वह पीले रंग से जुड़ी है।[1] उनका एक नाम पीतांबरा भी है। वह विभिन्न रत्नों से सुसज्जित खंभों वाले स्वर्ण सिंहासन पर विराजमान हैं और उनकी तीन आंखें हैं, जो इस बात का प्रतीक है कि वह भक्त को परम ज्ञान प्रदान कर सकती है।",
    benefits: "मां बगलामुखी की पूजा से लाभ शत्रुनाश, वाकसिद्धि, वाद-विवाद में विजय आदि के लिए मां बगलामुखी की साधना काफी शुभ एवं लाभ पहुंचाने वाली है। बगलामुखी मां की उपासना से हर प्रकार के तंत्र से निजात मिलती है।",
};

// Define the Individual Maa Baglamukhi Siddha Yagya object in Hindi
const individualYagyaHindi = {
    description: "व्यक्तिगत मां बगलामुखी सिद्ध यज्ञ",
    fields: [
        "बगलामुखी माताजी मंदिर हिमाचल प्रदेश से मां बगलामुखी यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको भेजा जायेगा।",
        "पूजा संकल्प के समय, व्यक्तिगत नाम और गोत्र का उच्चारण किया जाएगा।",
        "आप बगलामुखी माताजी को साड़ी और हवन में भोग-प्रसाद अर्पण करने का चयन कर सकते हैं।",
        "प्रसाद आपके घर भेजा जायेगा।",
    ],
};

// Define the Family Baglamukhi Siddha Yagya object in Hindi
const familyYagyaHindi = {
    description: "परिवार मां बगलामुखी सिद्ध यज्ञ",
    fields: [
        "बगलामुखी माताजी मंदिर, हिमाचल प्रदेश से मां बगलामुखी यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको भेजा जायेगा।",
        "पूजा संकल्प के समय, आपके परिवार के सदस्यों के नाम और गोत्र (केवल 8) का उच्चारण किया जाएगा।",
        "आप बगलामुखी माताजी को साड़ी या हवन में भोग-प्रसाद अर्पण करने का चयन कर सकते हैं।",
        "प्रसाद आपके घर भेजा जायेगा।",
    ],
};

// Define the Family Maa Baglamukhi Siddha Yagya + Bhog-Prasad object in Hindi
const familyYagyaBhogPrasadHindi = {
    description: "परिवार मां बगलामुखी सिद्ध यज्ञ + भोग-प्रसाद",
    fields: [
        "बगलामुखी माताजी मंदिर, हिमाचल प्रदेश से मां बगलामुखी यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको भेजा जायेगा।",
        "पूजा संकल्प के समय, आपके परिवार के सदस्यों के नाम और गोत्र (केवल 8) का उच्चारण किया जाएगा।",
        "आपके नाम में माँ बगलामुखी को हवन में भोग-प्रसाद भेंट अर्पण की जाएगी और इसकी रिकार्डेड वीडियो आपको भेजी जाएगी।",
        "आप बगलामुखी माताजी को साड़ी अर्पण करने का चयन कर सकते हैं।",
        "प्रसाद आपके घर भेजा जायेगा।",
    ],
};

// Export the objects for use in other parts of the code
module.exports = { baglamukhiHindi, individualYagyaHindi, familyYagyaHindi, familyYagyaBhogPrasadHindi };
