// Define the Jwala Devi (Hindi) object
const jwalaDeviHindi = {
    name: "ज्वाला जी या ज्वाला देवी मंदिर",
    description:
        "ज्वाला जी या ज्वाला देवी मंदिर भारत के 51 शक्तिपीठों में से एक है और ज्वाला जी मंदिर भारत में अत्यधिक प्रतिष्ठित शक्ति मंदिरों में से एक है। यह कांगड़ा घाटी की शिवालिक श्रृंखला की गोद में स्थित है जिसे 'कालीधार' कहा जाता है। ऐसा माना जाता है कि यह पांडवों द्वारा बनाया गया पहला मंदिर है।",
    belief:
        "माना जाता है कि सती की जीभ उसी स्थान पर गिरी थी जहां अब ज्वाला देवी मंदिर स्थित है। सती की जीभ का प्रतिनिधित्व पवित्र ज्वाला या ज्वाला द्वारा किया जाता है जो निरंतर जलती रहती है। पौराणिक मान्यताओं के अनुसार, इस स्थान पर माता सती की जीभ गिरी थी। यहां माता ज्वाला के रूप में विराजमान हैं और भगवान शिव यहां उन्मत भैरव के रूप में स्थित हैं। इस मंदिर का चमत्कार यह है कि यहां कोई मूर्ति नहीं है बल्कि पृथ्वी के गर्भ से निकल रही 9 ज्वालों की पूजा की जाती है।",
    worship:
        "माता ज्वाला जी की पूजा हर प्रकार की चिंता मिटाने के लिए, मुकदमा झगड़ा आदि में विजय पाने के लिए, शत्रु से छुटकारा पाने के लिए, डर, शक, बाधा हटाने के लिए, हर कामना पूर्ण करने के लिए, व्यापार और सुख-संपत्ति की प्राप्ति के लिए, मान-सम्मान तथा लाभ प्राप्ति के लिए की जाती है।",
};

// Define the Individual (Hindi) object
const individualHindi = {
    description: "व्यक्तिगत व्यक्तियों के लिए, निम्नलिखित सेवाएँ प्रदान की जाती हैं:",
    fields: [
        "शक्तिपीठ ज्वाला देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको प्रदान किया जाएगा।",
        "शक्तिपीठ ज्वाला देवी में पूजा संकल्प के दौरान व्यक्ति के नाम और गोत्र का जप किया जाएगा।",
        "आप ज्वाला देवी मां को, चुन्नी, श्रृंगार और भोग चढ़ाना चुन सकते हैं और चढ़ावे का वीडियो आपके साथ साझा किया जाएगा।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};

// Define the Family Jwala Devi Siddha Yagya (Hindi) object
const familyYagyaHindi = {
    description: "परिवारों के लिए, निम्नलिखित सेवाएँ प्रदान की जाती हैं:",
    fields: [
        "शक्तिपीठ ज्वाला देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको प्रदान किया जाएगा।",
        "शक्तिपीठ में पूजा संकल्प के दौरान परिवार के सदस्यों के नाम और गोत्र का जप किया जाएगा।",
        "आप मां ज्वाला देवी को, चुन्नी, श्रृंगार और भोग चढ़ाना चुन सकते हैं और चढ़ावे का वीडियो आपके साथ साझा किया जाएगा।",
        "आप माता ज्वाला देवी को चांदी की जीभ चढ़ाने का विकल्प चुन सकते हैं।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};

// Define the Family Jwala Devi Siddha Yagya + Vastra (Hindi) object
const familyYagyaVastraHindi = {
    description: "वस्त्र विकल्प के साथ परिवारों के लिए, निम्नलिखित सेवाएँ प्रदान की जाती हैं:",
    fields: [
        "शक्तिपीठ ज्वाला देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको प्रदान किया जाएगा।",
        "शक्तिपीठ ज्वाला देवी में पूजा संकल्प के दौरान परिवार के सदस्यों के नाम और गोत्र (8 सदस्यों तक) का जप किया जाएगा।",
        "आपके नाम पर मां ज्वाला देवी को चुन्नी और श्रृंगार चढ़ाया जायेगा, इसका रिकॉर्ड किया गया वीडियो आपके साथ साझा किया जायेगा।",
        "आप मां ज्वाला देवी को भोग चढ़ाने का विकल्प चुन सकते हैं और प्रसाद का वीडियो आपके साथ साझा किया जायेगा।",
        "आप माता ज्वाला देवी को चांदी की जीभ चढ़ाने का विकल्प चुन सकते हैं।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};

// Define the Family Jwala Devi Siddha Yagya + Bhog (Hindi) object
const familyYagyaBhogHindi = {
    description: "भोग विकल्प के साथ परिवारों के लिए, निम्नलिखित सेवाएँ प्रदान की जाती हैं:",
    fields: [
        "शक्तिपीठ ज्वाला देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको प्रदान किया जाएगा।",
        "शक्तिपीठ ज्वाला देवी में पूजा संकल्प के दौरान परिवार के सदस्यों के नाम और गोत्र (8 सदस्यों तक) का जप किया जाएगा।",
        "आपके नाम पर मां ज्वाला देवी को भोग चढ़ाया जाएगा और उसका रिकॉर्ड किया गया वीडियो आपके साथ साझा किया जाएगा।",
        "आप मां ज्वाला देवी को चुन्नी और श्रृंगार चढ़ाने का विकल्प चुन सकते हैं और चढ़ावे का वीडियो आपके साथ साझा किया जाएगा।",
        "आप माता ज्वाला देवी को चांदी की जीभ चढ़ाने का विकल्प चुन सकते हैं।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};

// Export the objects for use in other parts of the code
module.exports = { jwalaDeviHindi, individualHindi, familyYagyaHindi, familyYagyaVastraHindi, familyYagyaBhogHindi };
