// Define the Naina Devi Hindi object
const nainaDeviHindi = {
    name: "नैना देवी",
    location: "हिमाचल प्रदेश, बिलासपुर",
    description:
        "नैना देवी हिंदूओं के पवित्र तीर्थ स्थलों में से एक है। हिमाचल प्रदेश के बिलासपुर जिले में है।...",
    benefits: [
        "मां नैना देवी की पूजा आंखों के रोगों को दूर करने के लिए की जाती है।",
        "धन और समृद्धि",
        "माँ नैना श्रीविद्या की देवी हैं। किसी भी शुभ दिन के अवसर पर इनकी पूजा करने का विशेष महत्व है...",
        "अच्छा स्वास्थ्य और संतान",
        "मां नैना देवी यज्ञ में भाग लेने से भक्तों को विभिन्न प्रकार की बीमारियों से सुरक्षा मिलती है।...",
    ],
};


const individualsHindi = {
    description: "व्यक्तियों के लिए नैना देवी पूजा और यज्ञ का विवरण निम्नलिखित है:",
    fields: [
        "शक्तिपीठ नैना देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको उपलब्ध कराया जाएगा।",
        "शक्तिपीठ नैना देवी में पूजा संकल्प के दौरान व्यक्ति के नाम और गोत्र का जाप किया जाएगा।",
        "आप मां नैनादेवी को चांदी की आंखें, चुन्नी, श्रृंगार और भोग चढ़ाना चुन सकते हैं और प्रसाद का वीडियो आपके साथ साझा किया जाएगा।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};


const familyHindi = {
    description: "परिवारों के लिए नैना देवी पूजा और यज्ञ का विवरण निम्नलिखित है:",
    fields: [
        "शक्तिपीठ नैना देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको उपलब्ध कराया जाएगा।",
        "शक्तिपीठ में पूजा संकल्प के दौरान परिवार के सदस्यों के नाम और गोत्र) का जप किया जाएगा",
        "आप मां नैना देवी को सिवर आंखें, चुन्नी, श्रृंगार, और भोग चढ़ाना चुन सकते हैं और प्रसाद का वीडियो आपके साथ साझा किया जाएगा।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};


const familyYagyaSilverEyesHindi = {
    description: "परिवारों के लिए नैना देवी सिद्ध यज्ञ + चांदी की आंखों का विवरण निम्नलिखित है:",
    fields: [
        "शक्तिपीठ नैना देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको उपलब्ध कराया जाएगा।",
        "शक्तिपीठ में पूजा संकल्प के दौरान परिवार के सदस्यों के नाम और गोत्र (8 सदस्यों तक) का जप किया जाएगा",
        "आपके नाम पर मां नैना देवी को चांदी की आंखें अर्पित की जाएंगी और इसका रिकॉर्ड किया गया वीडियो आपके साथ साझा किया जाएगा।",
        "आप मां नैना देवी को भोग, चुन्नी, और श्रृंगार चढ़ाने का विकल्प चुन सकते हैं और इसका वीडियो आपके साथ साझा किया जाएगा।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};


const familyYagyaBhogChunniShringarHindi = {
    description: "परिवारों के लिए नैना देवी सिद्ध यज्ञ + भोग, चुन्नी, श्रृंगार का विवरण निम्नलिखित है:",
    fields: [
        "शक्तिपीठ नैना देवी पूजा और यज्ञ की रिकॉर्डेड वीडियो का लिंक आपको उपलब्ध कराया जाएगा।",
        "शक्तिपीठ में पूजा संकल्प के दौरान परिवार के सदस्यों के नाम और गोत्र (8 सदस्यों तक) का जप किया जाएगा",
        "आपके नाम पर मां नैना देवी को भोग, चुन्नी, और श्रृंगार चढ़ाया जाएगा और इसका रिकॉर्ड किया गया वीडियो आपके साथ साझा किया जाएगा।",
        "आप मां नैना देवी को चांदी की आंखें चढ़ाने का विकल्प चुन सकते हैं और चढ़ावे का वीडियो आपके साथ साझा किया जाएगा।",
        "प्रसाद आपके घर भेज दिया जाएगा।",
    ],
};


module.exports = {
    nainaDeviHindi,
    individualsHindi,
    familyHindi,
    familyYagyaSilverEyesHindi,
    familyYagyaBhogChunniShringarHindi,
};
